tap "candid82/brew"
tap "d12frosted/emacs-plus"
tap "epk/epk"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "oven-sh/bun"
tap "teamookla/speedtest"
tap "yqrashawn/goku"
# Automatically exclude development dependencies from Time Machine backups
brew "asimov"
# Command-line to use AWS CLI credentials to launch the AWS console in a browser
brew "aws-console"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Platform built on V8 to build network applications
brew "node"
# Secure and free password manager for all of your devices
brew "bitwarden-cli"
# Emulator for x86 and PowerPC
brew "qemu"
# Linux virtual machines
brew "lima"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Trace a chain of DNS servers to the source
brew "dnstracer"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Isolated development environments using Docker
brew "docker-compose"
# Modern replacement for 'ls'
brew "exa"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Image processing and image analysis library
brew "leptonica"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Toolkit for creating graphical user interfaces
brew "gtk+3"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Library to render SVG files using Cairo
brew "librsvg"
# Mac App Store command-line interface
brew "mas"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Manage multiple Node.js versions
brew "nvm"
# Python 3 bindings for the Cairo graphics library
brew "py3cairo"
# GNOME Python bindings (based on GObject Introspection)
brew "pygobject3"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Cross-shell prompt for astronauts
brew "starship"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Internet file retriever
brew "wget"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Next-generation plugin manager for zsh
brew "zplug"
# UNIX shell (command interpreter)
brew "zsh"
brew "d12frosted/emacs-plus/emacs-plus@28", args: ["with-native-comp"]
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# Ookla Speedtest
brew "teamookla/speedtest/speedtest"
# karabiner configurator
brew "yqrashawn/goku/goku"
# GPU-accelerated terminal emulator
cask "alacritty"
# Application uninstaller
cask "appcleaner"
# Desktop password and login vault
cask "bitwarden"
# Bittorrent client
cask "c0re100-qbittorrent"
# E-books management software
cask "calibre"
# Utilities designed to make common development tasks easier
cask "devtoys"
# Reimagine your terminal
cask "fig"
# Developer targeted fonts with a high number of glyphs
cask "font-3270-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-agave-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-anonymice-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-arimo-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-aurulent-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-bigblue-terminal-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-bitstream-vera-sans-mono-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-blex-mono-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-caskaydia-cove-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-code-new-roman-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-comic-shanns-mono-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-cousine-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-daddy-time-mono-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-dejavu-sans-mono-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-droid-sans-mono-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-envy-code-r-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-fantasque-sans-mono-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-fira-code-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-fira-mono-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-go-mono-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-gohufont-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-hack-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-hasklug-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-heavy-data-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-hurmit-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-im-writing-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-inconsolata-go-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-inconsolata-lgc-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-inconsolata-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-intone-mono-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-iosevka-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-iosevka-term-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-jetbrains-mono-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-lekton-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-liberation-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-lilex-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-meslo-lg-nerd-font"
# Monospaced font inspired by the Minecraft typeface patched to add Nerd glyphs
cask "font-monocraft-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-monofur-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-monoid-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-mononoki-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-mplus-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-noto-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-open-dyslexic-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-overpass-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-profont-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-proggy-clean-tt-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-roboto-mono-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-sauce-code-pro-nerd-font"
cask "font-sf-mono-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-shure-tech-mono-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-space-mono-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-symbols-only-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-terminess-ttf-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-tinos-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-ubuntu-mono-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-ubuntu-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-victor-mono-nerd-font"
# Web browser
cask "google-chrome"
# Desktop automation application
cask "hammerspoon"
# Terminal built on web technologies
cask "hyper"
# Free and open-source media player
cask "iina"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Jellyfin desktop client
cask "jellyfin-media-player"
# Keyboard customizer
cask "karabiner-elements"
# Preview and audit Kindle eBooks
cask "kindle-previewer"
# Utility that shows the latest app updates
cask "latest"
# Clipboard manager
cask "maccy"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Collaboration platform for API development
cask "postman"
# Control your tools with a few keystrokes
cask "raycast"
# VPN client for secure internet access and private browsing
cask "surfshark"
# Unpacks archive files
cask "the-unarchiver"
# To-do list
cask "todoist"
# Free and open-source OpenVPN client
cask "tunnelblick"
# Open-source code editor
cask "visual-studio-code"
# Web browser with built-in email client focusing on customization and control
cask "vivaldi"
# Multimedia player
cask "vlc"
# Rust-based terminal
cask "warp"
# Torrent streaming application
cask "webtorrent"
# Active space menu bar icon
cask "whichspace"
vscode "aaron-bond.better-comments"
vscode "adpyke.codesnap"
vscode "adpyke.vscode-sql-formatter"
vscode "akamud.vscode-theme-onedark"
vscode "alefragnani.Bookmarks"
vscode "alefragnani.project-manager"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "Bito.Bito"
vscode "bodil.file-browser"
vscode "ChakrounAnas.turbo-console-log"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "Ciantic.keymapceditor-vsc"
vscode "codezombiech.gitignore"
vscode "cschlosser.doxdocgen"
vscode "dannysteenman.cloudformation-yaml-snippets"
vscode "dbaeumer.vscode-eslint"
vscode "deerawan.vscode-dash"
vscode "donjayamanne.git-extension-pack"
vscode "donjayamanne.githistory"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "emeraldwalk.RunOnSave"
vscode "esbenp.prettier-vscode"
vscode "firsttris.vscode-jest-runner"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "genieai.chatgpt-vscode"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "GitHub.remotehub"
vscode "GitHub.vscode-pull-request-github"
vscode "Gruntfuggly.todo-tree"
vscode "hbenl.vscode-test-explorer"
vscode "hediet.vscode-drawio"
vscode "humao.rest-client"
vscode "jacobdufault.fuzzy-search"
vscode "jeff-hykin.better-cpp-syntax"
vscode "jkillian.custom-local-formatters"
vscode "kahole.magit"
vscode "kddejong.vscode-cfn-lint"
vscode "kejun.devtoys"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vsliveshare.vsliveshare"
vscode "narsenico.vscode-progressive-increment"
vscode "Orta.vscode-jest"
vscode "PKief.material-icon-theme"
vscode "qufiwefefwoyn.kanagawa"
vscode "redhat.ansible"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.LiveServer"
vscode "rlivings39.fzf-quick-open"
vscode "sdras.night-owl"
vscode "searKing.preview-vscode"
vscode "sourcegraph.cody-ai"
vscode "sourcegraph.sourcegraph"
vscode "spadin.zmk-tools"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-german"
vscode "tonka3000.raycast"
vscode "usernamehw.errorlens"
vscode "vinliao.fast-arrow"
vscode "vintharas.learn-vim"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "VSpaceCode.vspacecode"
vscode "VSpaceCode.whichkey"
vscode "waderyan.gitblame"
vscode "WallabyJs.wallaby-vscode"
vscode "withfig.fig"
vscode "xyz.local-history"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
vscode "ziyasal.vscode-open-in-github"
